{
    "Fog Cloud": "(1st lvl spell) Takes 1 action, up to 1 hour duration with concentration at a range of 120 feet. You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above 1st.", 
    "Lesser Restoration": "(2nd lvl spell) Takes 1 action, you touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafended, paralyzed, or poisoned.", 
    "Alarm": "(1st lvl spell) 1 minute casting time up to 30 feet range. Duration is up to 8 hours. You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible. Mental alarm awakens you from sleep and can be heard 1 mile away. Auduble alarm produces the sound of a hand bell for 10 seconds within 60 feet.", 
    "Rope Trick": "(2nd level spell). 1hr duration. Verbal, gesture, material components. You touch a length of rope that is up to 60 feet long. One end of the rope then rises inlo lhe air until the whole rope hangs perpendicular lo the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends. The space can hold as many as eight Medium or smaller creatures. The rope can be pulled into the space, Attacks and spells can't cross through the entrance into or out of the extradimensional space. Anything inside of the space drops out when the spell ends.", 
    "Silence": "(2nd lvl spell) Takes 1 action, up to 10 minute duration with concentration at a range of 120 feet. For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there."
}